oxlm/rt-thread/bsp/nxp/mcx/mcxn/libraries/drivers/drv_mic.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2026-09-22     RT-Thread    three-channel ADC microphone audio device
 *
 * ADC0 side A + ADC1 side A + ADC1 side B, hardware-triggered by CTIMER0 and
 * drained by three loop EDMA channels. The three raw streams are de-DC'd and
 * interleaved one millisecond at a time, then pushed into the record pipe as
 * one 16 bit little-endian frame per channel.
 *
 * The stream format is fixed: 16000 Hz, 3 channels, 16 bits. Everything that
 * produces it (CTIMER period, LPADC trigger, DMA block size, packet length) is
 * a constant, so configure() reports that rather than applying a change.
 */

#include <rtthread.h>
#include <rtdevice.h>
#include <rthw.h>

#define DBG_TAG "adc_mic"
#define DBG_LVL DBG_INFO
#include <rtdbg.h>

#ifdef BSP_USING_ADC_MIC

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "fsl_clock.h"
#include "fsl_common.h"
#include "fsl_ctimer.h"
#include "fsl_edma.h"
#include "fsl_inputmux.h"
#include "fsl_inputmux_connections.h"
#include "fsl_lpadc.h"
#include "fsl_opamp.h"
#include "fsl_port.h"

#include "drivers/dev_audio.h"
#include "drv_mic.h"

#define DRV_MIC_DMA_BLOCKS 8U

#define DRV_MIC_ADC_CMD_ID     1U
#define DRV_MIC_ADC_TRIGGER_ID 0U

#define DRV_MIC_DMA_CHANNEL_ADC0_A 0U
#define DRV_MIC_DMA_CHANNEL_ADC1_A 3U
#define DRV_MIC_DMA_CHANNEL_ADC1_B 4U

#ifndef DRV_MIC_USE_OPAMP
#define DRV_MIC_USE_OPAMP 0
#endif

/* One-pole high-pass filter on the ADC path, feeding the backend directly. It
 * is the DC blocker here: with kLPADC_ReferenceVoltageAlt3 the LPADC spans
 * 0..VDD_ANA, so 0 V is the bottom of its range, and there is no VREF/2 bias
 * network on the input (DRV_MIC_USE_OPAMP is 0), so the DC has to be removed
 * in software.
 *
 * The 16 bit ADC_RESFIFO_D field goes in rather than a raw-32768 PCM value: the
 * filter only ever sees x[n]-x[n-1], so the DC offset of the 0..VDD_ANA range
 * cancels in the difference.
 *
 * The coefficients are not written by hand: drv_mic_calc_hpf_coeffs() derives
 * them from fc and the sample rate with a prewarped bilinear transform of the
 * analog prototype H(s) = s/(s + w_a), which makes the whole filter reproducible
 * from DRV_MIC_HPF_CUTOFF_HZ alone. For fc = 5 Hz, fs = 16 kHz that is
 * a = 0.998038 and b0 = 0.999019, and the response is
 * -3 dB at 5.012 Hz, -0.26 dB at 20 Hz, -0.04 dB at 50 Hz, -0.02 dB at 80 Hz,
 * -0.003 dB at 200 Hz and 0 dB at Nyquist, so voice content (roughly 80 Hz and
 * up) passes through uncut. A DC step settles after about 5 tau = 160 ms
 * (tau = 1/(2*pi*fc) = 31.8 ms). */
#define DRV_MIC_HPF_CUTOFF_HZ 5.0f
#define DRV_MIC_PI            3.141592653589793f
#define DRV_MIC_CTIMER_MATCH_RATE DRV_MIC_SAMPLE_RATE

/* LPADC channel numbers for ADC0_A2 + ADC1_A0 + ADC1_B0. */
#ifndef DRV_MIC_ADC0_A_CHANNEL
#define DRV_MIC_ADC0_A_CHANNEL 2U
#endif

#ifndef DRV_MIC_ADC1_A_CHANNEL
#define DRV_MIC_ADC1_A_CHANNEL 0U
#endif

#ifndef DRV_MIC_ADC1_B_CHANNEL
#define DRV_MIC_ADC1_B_CHANNEL 0U
#endif

#ifndef DRV_MIC_OPAMP_GAIN
#define DRV_MIC_OPAMP_GAIN kOPAMP_PosGainNonInvert1X
#endif

struct drv_mic_dev
{
    struct rt_audio_device audio;
    struct rt_audio_configure record_config;
};

static struct drv_mic_dev s_mic_dev;

/* Only the eDMA callbacks and the start/stop ops touch this, and start() sets
 * it after the DMA loops are armed while stop() clears it before CTIMER0 is
 * stopped, so a callback never observes a tearing value. */
static volatile bool s_capturing;

/* Per-channel filter state: the previous input and the previous output, both
 * stored as float so the feedback path carries the full unquantized value. The
 * int16 quantization happens only at the output of drv_mic_hpf(), so its
 * rounding error never feeds back and cannot accumulate into a DC offset.
 *
 * drv_mic_hpf() only runs from the eDMA callback while s_capturing is true,
 * and drv_mic_reset_state() only from drv_mic_start() while it is false, so the
 * two never overlap and no locking is needed. Deliberately not volatile: only
 * the CPU touches these, unlike s_adc*_samples[] which the DMA writes. */
static float s_hpf_prev_in[DRV_MIC_CHANNELS];
static float s_hpf_prev_out[DRV_MIC_CHANNELS];

/* Coefficients are derived once when the device is opened (drv_mic_init) and
 * then only multiplied by drv_mic_hpf() in the eDMA callback, so no volatile
 * is needed: nothing rewrites them while a transfer is running. */
static float s_hpf_alpha;
static float s_hpf_gain;

AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc0_a_samples[DRV_MIC_DMA_BLOCKS][DRV_MIC_SAMPLES_PER_MS], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc1_a_samples[DRV_MIC_DMA_BLOCKS][DRV_MIC_SAMPLES_PER_MS], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc1_b_samples[DRV_MIC_DMA_BLOCKS][DRV_MIC_SAMPLES_PER_MS], 4U);

/* Not EDMA_ALLOCATE_TCD(): that macro spells the declaration itself as
 * "edma_tcd_t name[number]", so "static" cannot get in. */
AT_NONCACHEABLE_SECTION_ALIGN(static edma_tcd_t s_adc0_a_tcd[DRV_MIC_DMA_BLOCKS], EDMA_TCD_ALIGN_SIZE);
AT_NONCACHEABLE_SECTION_ALIGN(static edma_tcd_t s_adc1_a_tcd[DRV_MIC_DMA_BLOCKS], EDMA_TCD_ALIGN_SIZE);
AT_NONCACHEABLE_SECTION_ALIGN(static edma_tcd_t s_adc1_b_tcd[DRV_MIC_DMA_BLOCKS], EDMA_TCD_ALIGN_SIZE);

static edma_handle_t s_dma_handle[DRV_MIC_CHANNELS];
static edma_transfer_config_t s_dma_transfer[DRV_MIC_CHANNELS][DRV_MIC_DMA_BLOCKS];
static volatile uint32_t s_dma_done_count[DRV_MIC_CHANNELS];
static volatile uint32_t s_mixed_count;

static const volatile uint32_t * const s_adc_sample_src[DRV_MIC_CHANNELS] = {
    &s_adc0_a_samples[0][0],
    &s_adc1_a_samples[0][0],
    &s_adc1_b_samples[0][0],
};

static void drv_mic_prepare_dma_ring(edma_handle_t *handle,
                                     edma_transfer_config_t *transfer,
                                     edma_tcd_t *tcd,
                                     uint32_t channel,
                                     int32_t request,
                                     const volatile uint32_t *fifo,
                                     volatile uint32_t raw[DRV_MIC_DMA_BLOCKS][DRV_MIC_SAMPLES_PER_MS],
                                     void *callback_user_data);
static bool drv_mic_start_dma_ring(edma_handle_t *handle, edma_transfer_config_t *transfer);

/* Prewarped bilinear transform of the analog prototype H(s) = s/(s + w_a) with
 * w_a = fs * tan(pi * fc / fs). Substituting s = fs * (1 - z^-1) / (1 + z^-1)
 * and collecting terms gives
 *     y[n] = a * y[n-1] + b0 * (x[n] - x[n-1])
 *         a  = (fs - w_a) / (fs + w_a)
 *         b0 = fs / (fs + w_a)   == (1 + a) / 2, unity gain at Nyquist
 * Both are stored as float. Runs once per open, so the float cost never
 * touches the sampling path. */
static void drv_mic_calc_hpf_coeffs(void)
{
    float fs;
    float w_a;

    fs = (float)DRV_MIC_SAMPLE_RATE;
    w_a = fs * tanf(DRV_MIC_PI * DRV_MIC_HPF_CUTOFF_HZ / fs);

