oxlm/rt-thread/bsp/nxp/mcx/mcxn/libraries/drivers/drv_mic.c
    s_hpf_alpha = (fs - w_a) / (fs + w_a);
    s_hpf_gain  = fs / (fs + w_a);

    LOG_I("hpf fc=%.1f Hz: a=%.6f b0=%.6f\n",
          (double)DRV_MIC_HPF_CUTOFF_HZ,
          (double)s_hpf_alpha,
          (double)s_hpf_gain);
}

/* One-pole high-pass, direct form:
 *     y[n] = a * y[n-1] + b0 * (x[n] - x[n-1])
 * with H(z) = b0 * (1 - z^-1) / (1 - a * z^-1), so |H(pi)| = 2*b0/(1+a) = 1.0.
 *
 * x is the 16 bit ADC_RESFIFO_D field, 0..65535. The FIFO metadata above bit 15
 * (command source, loop count, valid) is stripped before it gets here, so a
 * change in any of those fields cannot reach the arithmetic.
 *
 * All internal arithmetic is float. The key point is that prev_out stores the
 * unquantized float y, not the int16 output. Output quantization noise stays
 * local to that sample and does not feed back through the a = 0.998 loop,
 * which is why a DC step settles to float-precision zero instead of stalling
 * at half a count.
 *
 * The clip is the only place int16 is applied. A full-range DC step pushes
 * y[0] = b0 * 65535 = 65471, which is clamped to 32767 and decays from there;
 * |H(pi)| = 1 means a steady full-scale square wave peaks exactly at 32767 and
 * does not clip. */
static int16_t drv_mic_hpf(uint16_t raw, uint32_t ch)
{
    float diff;
    float y;

    diff = (float)raw - s_hpf_prev_in[ch];
    s_hpf_prev_in[ch] = (float)raw;

    y = s_hpf_alpha * s_hpf_prev_out[ch] + s_hpf_gain * diff;
    s_hpf_prev_out[ch] = y;

    if (y > 32767.0f)
    {
        y = 32767.0f;
    }
    else if (y < -32768.0f)
    {
        y = -32768.0f;
    }

    return (int16_t)lrintf(y);
}

static void drv_mic_mix_block(uint32_t block)
{
    uint8_t pcm[DRV_MIC_PACKET_BYTES];
    uint8_t *dst;

    dst = pcm;
    for (uint32_t i = 0U; i < DRV_MIC_SAMPLES_PER_MS; i++)
    {
        for (uint32_t ch = 0U; ch < DRV_MIC_CHANNELS; ch++)
        {
            const volatile uint32_t *src;
            int16_t sample;

            src = s_adc_sample_src[ch] + (block * DRV_MIC_SAMPLES_PER_MS);
            sample = drv_mic_hpf((uint16_t)ADC_RESFIFO_D(src[i]), ch);
            *dst++ = (uint8_t)(sample & 0xff);
            *dst++ = (uint8_t)(((uint16_t)sample >> 8) & 0xff);
        }
    }

    /* rt_audio_rx_done() writes to the record pipe with RT_PIPE_FLAG_FORCE_WR,
     * so a full pipe drops the oldest frame instead of blocking this callback. */
    rt_audio_rx_done(&s_mic_dev.audio, pcm, sizeof(pcm));
}

static uint32_t drv_mic_min_done_count(void)
{
    uint32_t min_done;

    min_done = s_dma_done_count[0];
    if (s_dma_done_count[1] < min_done)
    {
        min_done = s_dma_done_count[1];
    }
    if (s_dma_done_count[2] < min_done)
    {
        min_done = s_dma_done_count[2];
    }

    return min_done;
}

static void drv_mic_dma_callback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds)
{
    uint32_t dma_index;
    uint32_t done_blocks;

    (void)handle;

    dma_index = (uint32_t)(uintptr_t)userData;
    if (dma_index >= DRV_MIC_CHANNELS)
    {
        return;
    }
    if (!s_capturing)
    {
        return;
    }

    done_blocks = tcds;
    if (done_blocks == 0U)
    {
        if (!transferDone)
        {
            return;
        }
        done_blocks = 1U;
    }

    s_dma_done_count[dma_index] += done_blocks;
    while (s_mixed_count < drv_mic_min_done_count())
    {
        uint32_t block;

        block = s_mixed_count % DRV_MIC_DMA_BLOCKS;
        drv_mic_mix_block(block);
        s_mixed_count++;
    }
}

/* drv_mic_start() runs with s_capturing false and no DMA loop armed, so the
 * counters and filter state can be zeroed under interrupt disable without a
 * real race. */
static void drv_mic_reset_state(void)
{
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    s_dma_done_count[0] = 0U;
    s_dma_done_count[1] = 0U;
    s_dma_done_count[2] = 0U;
    s_mixed_count = 0U;
    for (uint32_t ch = 0U; ch < DRV_MIC_CHANNELS; ch++)
    {
        s_hpf_prev_in[ch] = 0;
        s_hpf_prev_out[ch] = 0;
    }
    rt_hw_interrupt_enable(level);
}

static void drv_mic_prepare_dma_ring(edma_handle_t *handle,
                                     edma_transfer_config_t *transfer,
                                     edma_tcd_t *tcd,
                                     uint32_t channel,
                                     int32_t request,
                                     const volatile uint32_t *fifo,
                                     volatile uint32_t raw[DRV_MIC_DMA_BLOCKS][DRV_MIC_SAMPLES_PER_MS],
                                     void *callback_user_data)
{
    EDMA_CreateHandle(handle, DMA0, channel);
    EDMA_InstallTCDMemory(handle, tcd, DRV_MIC_DMA_BLOCKS);
    EDMA_SetChannelMux(DMA0, channel, request);
    EDMA_SetCallback(handle, drv_mic_dma_callback, callback_user_data);

    for (uint32_t i = 0U; i < DRV_MIC_DMA_BLOCKS; i++)
    {
        EDMA_PrepareTransfer(&transfer[i],
                             (void *)fifo,
                             sizeof(uint32_t),
                             (void *)&raw[i][0],
                             sizeof(uint32_t),
                             sizeof(uint32_t),
                             sizeof(raw[i]),
                             kEDMA_PeripheralToMemory);
    }
}

static bool drv_mic_start_dma_ring(edma_handle_t *handle, edma_transfer_config_t *transfer)
{
    status_t status;

    EDMA_AbortTransfer(handle);
    status = EDMA_SubmitLoopTransfer(handle, transfer, DRV_MIC_DMA_BLOCKS);
    if (status != kStatus_Success)
    {
        LOG_E("adc mic EDMA submit failed: %d\n", (int)status);
        return false;
    }

    EDMA_StartTransfer(handle);

    return true;
}

static void drv_mic_init_opamp(OPAMP_Type *base)
{
    opamp_config_t config;

    OPAMP_GetDefaultConfig(&config);
    config.enable = true;
    config.mode = kOPAMP_LowNoiseMode;
    config.posGain = DRV_MIC_OPAMP_GAIN;
    config.negGain = kOPAMP_NegGainBufferMode;
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_OUTSW) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_OUTSW
    config.enableOutputSwitch = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW1) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW1
    config.enablePosADCSw1 = true;
#else
    config.enablePosADCSw = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW2) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW2
    config.enablePosADCSw2 = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_BUFEN) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_BUFEN
    config.enableRefBuffer = ((uint32_t)DRV_MIC_OPAMP_GAIN <= 7U);
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_INPSEL) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_INPSEL
    config.PosInputChannelSelection = kOPAMP_PosInputChannel0;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_TRIGMD) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_TRIGMD
    config.enableTriggerMode = false;
#endif

    OPAMP_Init(base, &config);
}

static void drv_mic_config_adc_pins(void)
{
    const port_pin_config_t adc0_a2_config = {
        kPORT_PullDisable,
        kPORT_LowPullResistor,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable,
        kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength,
        kPORT_MuxAlt0,
        kPORT_InputBufferDisable,
        kPORT_InputNormal,
        kPORT_UnlockRegister,
    };

