oxlm/rt-thread/bsp/nxp/mcx/mcxn/libraries/drivers/drv_mic.c
    return RT_EOK;
}

static rt_err_t drv_mic_getcaps(struct rt_audio_device *audio, struct rt_audio_caps *caps)
{
    rt_err_t result = RT_EOK;

    RT_ASSERT(audio != RT_NULL);
    RT_ASSERT(caps != RT_NULL);

    switch (caps->main_type)
    {
    case AUDIO_TYPE_QUERY:
        caps->udata.mask = AUDIO_TYPE_INPUT;
        break;

    case AUDIO_TYPE_INPUT:
        switch (caps->sub_type)
        {
        case AUDIO_DSP_PARAM:
            caps->udata.config.samplerate = s_mic_dev.record_config.samplerate;
            caps->udata.config.channels = s_mic_dev.record_config.channels;
            caps->udata.config.samplebits = s_mic_dev.record_config.samplebits;
            break;

        case AUDIO_DSP_SAMPLERATE:
            caps->udata.config.samplerate = s_mic_dev.record_config.samplerate;
            break;

        case AUDIO_DSP_CHANNELS:
            caps->udata.config.channels = s_mic_dev.record_config.channels;
            break;

        case AUDIO_DSP_SAMPLEBITS:
            caps->udata.config.samplebits = s_mic_dev.record_config.samplebits;
            break;

        default:
            result = -RT_ERROR;
            break;
        }
        break;

    default:
        result = -RT_ERROR;
        break;
    }

    return result;
}

static rt_err_t drv_mic_configure(struct rt_audio_device *audio, struct rt_audio_caps *caps)
{
    rt_err_t result = RT_EOK;

    RT_ASSERT(audio != RT_NULL);
    RT_ASSERT(caps != RT_NULL);

    switch (caps->main_type)
    {
    case AUDIO_TYPE_INPUT:
        switch (caps->sub_type)
        {
        case AUDIO_DSP_PARAM:
            if ((caps->udata.config.samplerate != DRV_MIC_SAMPLE_RATE) ||
                (caps->udata.config.channels != DRV_MIC_CHANNELS) ||
                (caps->udata.config.samplebits != DRV_MIC_SAMPLE_BITS))
            {
                LOG_E("adc mic only supports %u Hz, %u ch, %u bit\n",
                      (unsigned)DRV_MIC_SAMPLE_RATE,
                      (unsigned)DRV_MIC_CHANNELS,
                      (unsigned)DRV_MIC_SAMPLE_BITS);
                result = -RT_ERROR;
            }
            break;

        case AUDIO_DSP_SAMPLERATE:
            if (caps->udata.config.samplerate != DRV_MIC_SAMPLE_RATE)
            {
                result = -RT_ERROR;
            }
            break;

        case AUDIO_DSP_CHANNELS:
            if (caps->udata.config.channels != DRV_MIC_CHANNELS)
            {
                result = -RT_ERROR;
            }
            break;

        case AUDIO_DSP_SAMPLEBITS:
            if (caps->udata.config.samplebits != DRV_MIC_SAMPLE_BITS)
            {
                result = -RT_ERROR;
            }
            break;

        default:
            result = -RT_ERROR;
            break;
        }
        break;

    default:
        result = -RT_ERROR;
        break;
    }

    return result;
}

static rt_err_t drv_mic_start(struct rt_audio_device *audio, int stream)
{
    RT_ASSERT(audio != RT_NULL);

    if (stream != AUDIO_STREAM_RECORD)
    {
        return -RT_ERROR;
    }

    s_capturing = false;
    drv_mic_reset_state();

    LPADC_DoResetFIFO0(ADC0);
    LPADC_DoResetFIFO0(ADC1);
    LPADC_DoResetFIFO1(ADC1);

    if (!drv_mic_start_dma_ring(&s_dma_handle[0], &s_dma_transfer[0][0]))
    {
        return -RT_ERROR;
    }
    if (!drv_mic_start_dma_ring(&s_dma_handle[1], &s_dma_transfer[1][0]))
    {
        EDMA_AbortTransfer(&s_dma_handle[0]);
        return -RT_ERROR;
    }
    if (!drv_mic_start_dma_ring(&s_dma_handle[2], &s_dma_transfer[2][0]))
    {
        EDMA_AbortTransfer(&s_dma_handle[0]);
        EDMA_AbortTransfer(&s_dma_handle[1]);
        return -RT_ERROR;
    }

    /* CTIMER0 is started last so no conversion is triggered until all three DMA
     * loops are armed and s_capturing allows the callback through. */
    s_capturing = true;

    CTIMER_Reset(CTIMER0);
    CTIMER_StartTimer(CTIMER0);

    LOG_D("start adc mic record");
    return RT_EOK;
}

static rt_err_t drv_mic_stop(struct rt_audio_device *audio, int stream)
{
    RT_ASSERT(audio != RT_NULL);

    if (stream != AUDIO_STREAM_RECORD)
    {
        return -RT_ERROR;
    }

    /* Clear the flag before stopping CTIMER0 so an in-flight callback returns
     * without touching the counters or the filter state. */
    s_capturing = false;
    CTIMER_StopTimer(CTIMER0);
    EDMA_AbortTransfer(&s_dma_handle[0]);
    EDMA_AbortTransfer(&s_dma_handle[1]);
    EDMA_AbortTransfer(&s_dma_handle[2]);
    LPADC_DoResetFIFO0(ADC0);
    LPADC_DoResetFIFO0(ADC1);
    LPADC_DoResetFIFO1(ADC1);

    LOG_D("stop adc mic record");
    return RT_EOK;
}

static struct rt_audio_ops drv_mic_ops = {
    .getcaps = drv_mic_getcaps,
    .configure = drv_mic_configure,
    .init = drv_mic_init,
    .start = drv_mic_start,
    .stop = drv_mic_stop,
    /* Input-only device: rt_audio_register() gives a RT_DEVICE_FLAG_RDONLY device
     * a NULL replay struct, and _audio_dev_init() dereferences
     * audio->replay->buf_info whenever buffer_info is non-NULL. transmit is
     * unused on the record path. */
    .transmit = RT_NULL,
    .buffer_info = RT_NULL,
};

int rt_hw_mic_init(void)
{
    s_mic_dev.record_config.samplerate = DRV_MIC_SAMPLE_RATE;
    s_mic_dev.record_config.channels = DRV_MIC_CHANNELS;
    s_mic_dev.record_config.samplebits = DRV_MIC_SAMPLE_BITS;

    s_mic_dev.audio.ops = &drv_mic_ops;

    LOG_I("audio adc mic registered: %u Hz, %u ch, %u bit\n",
          (unsigned)DRV_MIC_SAMPLE_RATE,
          (unsigned)DRV_MIC_CHANNELS,
          (unsigned)DRV_MIC_SAMPLE_BITS);
    rt_audio_register(&s_mic_dev.audio, DRV_MIC_NAME, RT_DEVICE_FLAG_RDONLY, (void *)&s_mic_dev);

    return RT_EOK;
}
INIT_DEVICE_EXPORT(rt_hw_mic_init);

#endif /* BSP_USING_ADC_MIC */
